; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v9 ?v5)
             (pred_9 ?v4 ?v10)
             (pred_4 ?v9 ?v10)
             (pred_7 ?v8 ?v9 )
	     (pred_8 ?v9)
             (pred_3 ?v2)
             (pred_10 ?v4)
             (pred_1 ?v10)
             (pred_5 ?v9)
             (pred_6 ?v4)
             (pred_12 ?v9)
             (pred_11 ))



(:action op_3
:parameters (?v7 ?v12 ?v1 ?v3)
:precondition (and (pred_3 ?v7) (pred_3 ?v12) (pred_10 ?v1) (pred_1 ?v3)
          (pred_2 ?v7 ?v12) (pred_9 ?v1 ?v3)
                   (pred_4 ?v12 ?v3) (pred_8 ?v7) 
                   (pred_5 ?v12) (pred_6 ?v1))
:effect (and  (pred_12 ?v12) (not (pred_5 ?v12))))


(:action op_4
:parameters (?v7 ?v11)
:precondition (and (pred_3 ?v7) (pred_3 ?v11)
               (pred_8 ?v7) (pred_2 ?v7 ?v11) (pred_12 ?v11))
:effect (and (pred_8 ?v11) (not (pred_8 ?v7))))

(:action op_1
:parameters (?v7 ?v1)
:precondition (and (pred_3 ?v7) (pred_10 ?v1) 
                  (pred_8 ?v7) (pred_7 ?v1 ?v7) (pred_11 ))
:effect (and (pred_6 ?v1)
   (not (pred_7 ?v1 ?v7)) (not (pred_11 ))))


(:action op_5
:parameters (?v7 ?v13 ?v6)
:precondition (and (pred_3 ?v7) (pred_10 ?v13) (pred_10 ?v6)
                  (pred_8 ?v7) (pred_6 ?v6) (pred_7 ?v13 ?v7))
:effect (and (pred_6 ?v13) (pred_7 ?v6 ?v7)
        (not (pred_6 ?v6)) (not (pred_7 ?v13 ?v7))))

(:action op_2
:parameters (?v7 ?v1)
:precondition (and (pred_3 ?v7) (pred_10 ?v1) 
                  (pred_8 ?v7) (pred_6 ?v1))
:effect (and (pred_11 ) (pred_7 ?v1 ?v7) (not (pred_6 ?v1)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_08 obj_21 obj_19 obj_04 obj_16 obj_05 obj_15 obj_03 obj_12 obj_06 obj_02 obj_11 obj_20 obj_07 obj_18
    obj_13 obj_14
    obj_10 obj_01 obj_09
    )

    (:init
       (pred_11)

       (pred_3 obj_17)
       (pred_3 obj_08)
       (pred_3 obj_21)
       (pred_3 obj_19)
       (pred_3 obj_04)
       (pred_3 obj_16)
       (pred_3 obj_05)
       (pred_3 obj_15)
       (pred_3 obj_03)
       (pred_3 obj_12)
       (pred_3 obj_06)
       (pred_3 obj_02)
       (pred_3 obj_11)
       (pred_3 obj_20)
       (pred_3 obj_07)
       (pred_3 obj_18)
       (pred_1 obj_13)
       (pred_1 obj_14)
       (pred_10 obj_10)
       (pred_10 obj_01)
       (pred_10 obj_09)

       (pred_2 obj_17 obj_04)
       (pred_2 obj_17 obj_08)
       (pred_2 obj_08 obj_16)
       (pred_2 obj_08 obj_21)
       (pred_2 obj_08 obj_17)
       (pred_2 obj_21 obj_05)
       (pred_2 obj_21 obj_19)
       (pred_2 obj_21 obj_08)
       (pred_2 obj_19 obj_15)
       (pred_2 obj_19 obj_21)
       (pred_2 obj_04 obj_03)
       (pred_2 obj_04 obj_16)
       (pred_2 obj_04 obj_17)
       (pred_2 obj_16 obj_12)
       (pred_2 obj_16 obj_05)
       (pred_2 obj_16 obj_08)
       (pred_2 obj_16 obj_04)
       (pred_2 obj_05 obj_06)
       (pred_2 obj_05 obj_15)
       (pred_2 obj_05 obj_21)
       (pred_2 obj_05 obj_16)
       (pred_2 obj_15 obj_02)
       (pred_2 obj_15 obj_19)
       (pred_2 obj_15 obj_05)
       (pred_2 obj_03 obj_11)
       (pred_2 obj_03 obj_12)
       (pred_2 obj_03 obj_04)
       (pred_2 obj_12 obj_20)
       (pred_2 obj_12 obj_06)
       (pred_2 obj_12 obj_16)
       (pred_2 obj_12 obj_03)
       (pred_2 obj_06 obj_07)
       (pred_2 obj_06 obj_02)
       (pred_2 obj_06 obj_05)
       (pred_2 obj_06 obj_12)
       (pred_2 obj_02 obj_18)
       (pred_2 obj_02 obj_15)
       (pred_2 obj_02 obj_06)
       (pred_2 obj_11 obj_20)
       (pred_2 obj_11 obj_03)
       (pred_2 obj_20 obj_07)
       (pred_2 obj_20 obj_12)
       (pred_2 obj_20 obj_11)
       (pred_2 obj_07 obj_18)
       (pred_2 obj_07 obj_06)
       (pred_2 obj_07 obj_20)
       (pred_2 obj_18 obj_02)
       (pred_2 obj_18 obj_07)
       (pred_5 obj_21)
       (pred_5 obj_07)
       (pred_5 obj_04)
       (pred_4  obj_21 obj_13)
       (pred_4  obj_07 obj_14)
       (pred_4  obj_04 obj_14)
       (pred_12 obj_17)
       (pred_12 obj_08)
       (pred_12 obj_19)
       (pred_12 obj_16)
       (pred_12 obj_05)
       (pred_12 obj_15)
       (pred_12 obj_03)
       (pred_12 obj_12)
       (pred_12 obj_06)
       (pred_12 obj_02)
       (pred_12 obj_11)
       (pred_12 obj_20)
       (pred_12 obj_18)

       (pred_9  obj_10 obj_13)
       (pred_9  obj_01 obj_14)
       (pred_9  obj_09 obj_14)
       (pred_7 obj_10 obj_11)
       (pred_7 obj_01 obj_17)
       (pred_7 obj_09 obj_05)
       (pred_8 obj_15)
    )

    (:goal (and
       (pred_7 obj_09 obj_04)
    ))
(:constraints
  (always (not (pred_8 obj_16)))
)
)

; plan
1. (op_4 obj_15 obj_05)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_05)
   goals met: 0 of 1
2. (op_1 obj_05 obj_09)
   deleted: (pred_7 obj_09 obj_05) (pred_11)
   added: (pred_6 obj_09)
   goals met: 0 of 1
3. (op_4 obj_05 obj_06)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_06)
   goals met: 0 of 1
4. (op_4 obj_06 obj_12)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_12)
   goals met: 0 of 1
5. (op_4 obj_12 obj_03)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_03)
   goals met: 0 of 1
6. (op_3 obj_03 obj_04 obj_09 obj_14)
   deleted: (pred_5 obj_04)
   added: (pred_12 obj_04)
   goals met: 0 of 1
7. (op_4 obj_03 obj_04)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_04)
   goals met: 0 of 1
8. (op_2 obj_04 obj_09)
   deleted: (pred_6 obj_09)
   added: (pred_11) (pred_7 obj_09 obj_04)
   goals met: 1 of 1
